# SQL Cheat Sheet

![](images/SQL_Cheat_Sheet.png)

____

# SELECT Statement

- Can use `SELECT` or `select`, but using the upper-case version makes it more readable
- It is typically not good practice to use *

#### Examples

```sql
SELECT * FROM actor;
```

- Will return all columns from the `actor` table

```sql
SELECT first_name, last_name FROM actor;
```

- Will return the first and last name for each actor in the table

____

# Challenge: SELECT task

```sql
SELECT first_name, last_name, email FROM customer;
```

___

# SELECT DISTINCT

- If we have a column with repeating values, we can use `DISTINCT` to get only the unique values

#### Example

```sql
SELECT DISTINCT release_year FROM film;
```

____

# Challenge: SELECT DISTINCT

```sql
select DISTINCT rating from film;
```

____

# SELECT WHERE

#### Basic Syntax

```sql
SELECT col_1, col_2 FROM table WHERE conditions;
```

#### Basic Operators

![](images/Operators.png)

#### Example 1 - first name is Jamie

```sql
SELECT last_name, first_name
FROM customer
WHERE first_name = 'Jamie';
```

#### Example 2 - first name is Jamie andf last name is Rice

```sql
SELECT last_name, first_name
FROM customer
WHERE first_name = 'Jamie' AND last_name = 'Rice';
```

#### Example 3 - rental amount is either less than or equal to 1 dollar, or greater than or equal to 8 dollars

```sql
SELECT customer_id, amount, payment_date
FROM payment
WHERE amount <= 1 OR amount >=8;
```

____

# Challenge: SELECT WHERE

#### Challenge 1: what is the email for the customer with the name Nancy Thomas?

```sql
SELECT email 
FROM customer 
WHERE first_name = 'Nancy' 
AND last_name = 'Thomas';
```

##### Result
nancy.thomas@saikilacustomer.org

#### Challenge 2: what is the description for the movie Outlaw Hanky?

```sql
SELECT description 
FROM film
WHERE title = 'Outlaw Hanky';
```

##### Result
A Thoughtful Story of a Astronaut And a Composer who must Conquer a Dog in The Sahara Desert

#### Challenge 3: what is the phone number for the customer who lives at 259 Ipoh Drive?

```sql
SELECT phone 
FROM address 
WHERE address = '259 Ipoh Drive';
```

##### Result
419009857119

___

# COUNT

- The `COUNT` function returns the number of rows where a condition is TRUE

#### Example - number of customers

```sql
SELECT COUNT(*) FROM customer;
```

- **Note**: if we specify the count for a specific column, NULL values will not be counted

#### Example - number of distinct release years for films

```sql
SELECT COUNT(DISTINCT year) FROM film;
```

____

# LIMIT

- `LIMIT` allows you to limit the number of rows that are returned from a query
    - **Note**: this is equivalent to `df.head()` in pandas
    
#### Example

```sql
SELECT * FROM customers LIMIT 10;
```

___

# ORDER BY

#### Syntax

- Ascending

```sql
SELECT col_1, col_2
FROM table_name
ORDER BY col_1 ASC;
```

- Descending

```sql
SELECT col_1, col_2
FROM table_name
ORDER BY col_1 DESC;
```

- **Note**: if we don't specify ascending or descending, the default is ascending

#### Example - sorting customers by first name

```sql
SELECT first_name, last_name FROM customer
ORDER BY first_name ASC;
```

#### Example - sorting customers by first name ascending, then last name descending

```sql
SELECT first_name, last_name FROM customer
ORDER BY first_name ASC, last_name DESC;
```

- **Note**: in pandas, this is equivalent to:

```python
df.sort_values(['first_name', 'last_name'], ascending=[True, False])
```

___

# Challenge: ORDER BY

#### Challenge 1: get the customer ID numbers for the top 10 highest payment amounts

```sql
SELECT customer_id, amount
FROM payment
ORDER BY amount DESC
LIMIT 10;
```

#### Challenge 2: get the titles of the movies with film ids 1-5

```sql
SELECT title, film_id
FROM film
ORDER BY film_id ASC
LIMIT 5;
```

____

# BETWEEN

- We can use `BETWEEN` to check if a value is inside a set

#### Syntax

```sql
value BETWEEN low_val AND high_val
```

- This is equivalent to the alternative SQL statement

```sql
value >= low_val and value <= high_val
```

- We can also use `NOT BETWEEN` to check for values outside the set

```sql
value NOT BETWEEN low_val AND high_val
```

- This is equivalent to

```sql
value < low_val or value > high_val
```

#### Example - payment amount is between 8 and 9 dollars

```sql
SELECT customer_id, amount
FROM payment
WHERE amount BETWEEN 8 AND 9;
```

#### Example - payment date is between 2007/02/07 and 2007/02/15

```sql
SELECT amount, payment_date
FROM payment
WHERE payment_date BETWEEN '2007-02-07' AND '2007-02-15';
```

___

# IN

- We can use the `IN` operator to check if values are inside a list

#### Syntax

```sql
value IN (val_1, val_2, val_3,...)
```

- We don't need to explicitly write down each value
    - We use a query
    
```sql
value IN (SELECT DISTINCT col FROM tbl_name)
```

#### Example - get rows where the customer ID is either 1 or 2, order by return date

```sql
SELECT customer_id, rental_id, return_date
FROM rental
WHERE customer_id in (1,2)
ORDER BY return_date DESC;
```

____

# LIKE

#### Motivating example

- Let's say we want to find a customer whose first name starts with 'Jen'
    - Her name could be Jenny, Jennifer, Jenga, etc.
- It would be a major pain to manually look through the names to find the customer
    - Instead, we can just query the names using the `LIKE` operator
    
```sql
SELECT first_name, last_name 
FROM customer
WHERE first_name LIKE 'Jen%';
```

- Here, the % symbol is a wild card meaning anything can come after it
    - This technique is called **pattern matching**

- % is used to match any sequence of characters
- _ is used to match a single character

#### Example - customer name ends with a y

```sql
SELECT first_name, last_name 
FROM customer
WHERE first_name LIKE '%y';
```

#### Example - customer name contains er

```sql
SELECT first_name, last_name 
FROM customer
WHERE first_name LIKE '%er%';
```

#### Example - customer name contains er, but with only one charater preceding it

- For example, Theresa would satisfy this condition since the only character preceding the 'er' is 'T'
    - Heather would not satisfy it since there are many letters before er

```sql
SELECT first_name, last_name 
FROM customer
WHERE first_name LIKE '_er%';
```

- **Note:** if we don't want our `LIKE` statement to be case sensitive, we can use `ILIKE`

___

# General Challenge

#### Challenge 1 - how many payment transactions were greater than 5.00?

```sql
SELECT COUNT(DISTINCT payment_id) 
FROM payment 
WHERE amount > 5;
```

##### Result

3618

#### Challenge 2 - how many actors have a first name that starts with the letter P?

```sql
SELECT COUNT(first_name) 
FROM actor 
WHERE first_name LIKE 'P%';
```

##### Result

5

#### Challenge 3 - how many unique districts are our customers from?

```sql
SELECT COUNT(DISTINCT district) 
FROM address;
```

##### Result

378

#### Challenge 4 - get the list of distinct district names

```sql
SELECT DISTINCT district
FROM address;
```

#### Challenge 5 - how many films have a rating of R and a replacement cost between 5 and 15 dollars?

```sql
SELECT COUNT(*)
FROM film
WHERE rating = 'R'
AND replacement_cost BETWEEN 5 AND 15;
```

##### Result

52

#### Challenge 6 - how many films have the word Truman somewhere in the title?

```sql
SELECT COUNT(*)
FROM film
WHERE title LIKE '%Truman%';
```

##### Result

5